app/views/fortunes/show.html.erb


<% if @fortune.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."fortune_id" = 2
SELECT COUNT(*) FROM "comments" WHERE "comments"."fortune_id" = 2