app/controllers/authentications_controller.rb

SELECT "authentications".* FROM "authentications"
---
  def index
    @authentications = Authentication.all

INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 06 Nov 2011 23:22:11 UTC +00:00], ["provider", nil], ["uid", nil], ["updated_at", Sun, 06 Nov 2011 23:22:11 UTC +00:00], ["user_id", nil]]
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 1 AND "authentications"."provider" = 'twitter' AND "authentications"."uid" = '406521537' LIMIT 1
---
  def create(auth=request.env['omniauth.auth'])
  current_user.authentications.find_or_create_by_provider_and_uid(auth['provider'], auth['uid'])

SELECT "authentications".* FROM "authentications" WHERE "authentications"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "authentications" WHERE "authentications"."id" = ?  [["id", 1]]
---
  def destroy
    @authentication = Authentication.find(params[:id])
    @authentication.destroy