app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "body", "created_at", "fortune_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "fsaf"], ["body", "fsafsa"], ["created_at", Mon, 07 Nov 2011 08:59:27 UTC +00:00], ["fortune_id", 2], ["updated_at", Mon, 07 Nov 2011 08:59:27 UTC +00:00]]
---
  def create
    @comment = @fortune.comments.build(params[:comment])
    @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."fortune_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = @fortune.comments.find(params[:id])
    @comment.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."fortune_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @comment = @fortune.comments.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."fortune_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "comments" SET "body" = 'hfshfsdkuyfkuykyu', "updated_at" = '2011-11-07 09:23:57.569639' WHERE "comments"."id" = 5
---
  def update
    @comment = @fortune.comments.find(params[:id])
    @comment.update_attributes(params[:comment])