app/controllers/fortunes_controller.rb

SELECT "fortunes".* FROM "fortunes" ORDER BY source LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "fortunes" WHERE (source LIKE or body LIKE '%woody allen%')
SELECT "fortunes".* FROM "fortunes" WHERE (source LIKE'%woody allen%') ORDER BY source LIMIT 4 OFFSET 0
---
  def index
    @fortunes = Fortune.order(:source).page(params[:page]).per(5)
    @fortunes = Fortune.search(params[:search]).order(:source).page(params[:page]).per(4)

SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @fortune = Fortune.find(params[:id])

SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @fortune = Fortune.find(params[:id])

INSERT INTO "fortunes" ("body", "created_at", "source", "updated_at") VALUES (?, ?, ?, ?)  [["body", "gerger"], ["created_at", Sun, 06 Nov 2011 10:38:41 UTC +00:00], ["source", "gwerg"], ["updated_at", Sun, 06 Nov 2011 10:38:41 UTC +00:00]]
---
  def create
    @fortune = Fortune.new(params[:fortune])
    @fortune.save

SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "fortunes" SET "source" = 'Woody Allen', "body" = 'If you want to make God laugh, tell him about your plans.', "updated_at" = '2011-11-07 09:40:29.475002' WHERE "fortunes"."id" = 2
---
  def update
    @fortune = Fortune.find(params[:id])
    @fortune.update_attributes(params[:fortune])

SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "fortunes" WHERE "fortunes"."id" = ?  [["id", 6]]
---
  def destroy
    @fortune = Fortune.find(params[:id])
    @fortune.destroy